chas-challenge-code-6/hardware-esp32/include/battery.h
#ifndef BATTERY_H
#define BATTERY_H

#include "utilities.h"
#include "config.h"
#include <Arduino.h>
#include <TinyGsmClient.h>
#include <esp32-hal-adc.h> /// Include the ESP32 ADC library for analogReadMilliVolts

class BatteryMonitor
{
public:
    BatteryMonitor(int adcPin, float vMax = 4.2, float vMin = 3.3, float divider = 2.0);

    // Returns battery voltage in volts
    float readVoltage();

    // Returns battery percent (0-100)
    int percent();

    void setRGB(int percent);

private:
    int _adcPin;
    float _vMax, _vMin, _divider;

    int RED_PIN = RGB_RED_PIN; // GPIO pin for red LED
    int GREEN_PIN = RGB_GREEN_PIN; // GPIO pin for green LED   
};

class Battery
{
private:
    int batteryPin;
    float ADCbatteryVoltage;
    float rawBatteryVoltage;
    float batteryVoltageLimit;
    float batteryPercentage;
    int voltageDivider;

public:
    // Functions for monitoring battery status
    void begin();
    void loop();
    float getBatteryStatus();
    float getBatteryVoltage();
    void getUpdate();
    void sendData(); // For sending battery status to the server

    // Functions for power managment
    void powerSaveMode();
    bool isPowerOn(int pin);
    void turnOnPower(int pin);
    void turnOffPower(int pin);
    void safetyShutdown(float pin, float VoltLimit);
};

#endif
